#+TITLE: Analysis of HAN data
#+STARTUP: overview
#+AUTHOR:
#+PROPERTY: header-args :session han-data :async yes :eval-never-export :comments both :tangle hanalysis_org.py :padline no

* On clusters
According to cite:Buck1996 the size of an Ar cluster is:
\begin{equation}
\label{eq:arcluster}
R_n = \left( \frac{3mn}{4\pi\rho} \right)^{1/3} = n^{1/3}R_1,
\end{equation}
where:
- $m$, mass of an atom,
- $\rho$, density of the solid,
- $n$, number of atoms in the cluster.

For Ar cluster $R_1=2.08$ \AA, so density in kg/m^3 is:
#+begin_src jupyter-python
mAr = 39.95*1.660539e-27        # kg
R1 = 2.08e-10                   # m
rho = 3/4/np.pi*mAr/R1**3
rho
#+end_src

#+RESULTS:
: 1759.8969940542645

#+begin_src jupyter-python
def sph_inertia(Bcm: float):
    """Sphere's moment of inertia from rotational constant in cm-1."""
    return C.h/(100*C.c*8*np.pi**2*Bcm)

def nAr(I: float):
    """Number of argon atoms from moment of intertia of an argon ball."""
    return (5/2*I/mAr/R1**2)**(3/5)
#+end_src

#+RESULTS:

Moment of inertia of a solid sphere of Ar atoms is $I=\frac{2}{5}MR^2=\frac{2}{5}n^{5/3}m_{\text{Ar}}R_1^2$. Combining this with the standard equation for the rotational constant (in cm^{-1}) $I=\frac{h}{100 c 8 \pi^2 B_{\text{cm}}}$ gives as *24 Ar atoms* from $B=0.00122$ cm^{-1}.

